# predict the no. of females and males survived in titanic

#  Reading titinic.csv

In [1]:
import pandas as pd
df=pd.read_csv("titanic.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

# creating a dataframe

In [17]:
inputs=df[['PassengerId','Pclass','Sex']]   
inputs

     PassengerId  Pclass     Sex
0              1       3    male
1              2       1  female
2              3       3  female
3              4       1  female
4              5       3    male
..           ...     ...     ...
886          887       2    male
887          888       1  female
888          889       3  female
889          890       1    male
890          891       3    male

[891 rows x 3 columns]

# creating a target file

In [3]:
target=df['Survived']
target

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

# invoking a labelecoder

In [18]:
from sklearn.preprocessing import LabelEncoder
l_sex=LabelEncoder()

In [19]:
inputs['sex_n']=l_sex.fit_transform(inputs['Sex'])

<ipython-input-19-2bb9e2def5db>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  inputs['sex_n']=l_sex.fit_transform(inputs['Sex'])

In [20]:
inputs

     PassengerId  Pclass     Sex  sex_n
0              1       3    male      1
1              2       1  female      0
2              3       3  female      0
3              4       1  female      0
4              5       3    male      1
..           ...     ...     ...    ...
886          887       2    male      1
887          888       1  female      0
888          889       3  female      0
889          890       1    male      1
890          891       3    male      1

[891 rows x 4 columns]

In [7]:
inputs_n=inputs.drop(['Sex'],axis='columns')

In [8]:
inputs_n

     PassengerId  Pclass  sex_n
0              1       3      1
1              2       1      0
2              3       3      0
3              4       1      0
4              5       3      1
..           ...     ...    ...
886          887       2      1
887          888       1      0
888          889       3      0
889          890       1      1
890          891       3      1

[891 rows x 3 columns]

# Creating a decision tree clssifier and predict the output

In [21]:
from sklearn import tree
model=tree.DecisionTreeClassifier()

In [22]:
model.fit(inputs_n,target)

DecisionTreeClassifier()

In [23]:
model.predict([[700,2,0]])

array([1], dtype=int64)

In [24]:
model.score(inputs_n,target)

1.0

In [25]:
model.predict([[500,1,1]])

array([0], dtype=int64)

In [26]:
model.predict([[900,1,0]])

array([1], dtype=int64)

In [27]:
model.score(inputs_n,target)

1.0